{"weightsManifest": [{"paths": ["group1-shard1of12.bin", "group1-shard2of12.bin", "group1-shard3of12.bin", "group1-shard4of12.bin", "group1-shard5of12.bin", "group1-shard6of12.bin", "group1-shard7of12.bin", "group1-shard8of12.bin", "group1-shard9of12.bin", "group1-shard10of12.bin", "group1-shard11of12.bin", "group1-shard12of12.bin"], "weights": [{"dtype": "float32", "shape": [14], "name": "batch_normalization_21/gamma"}, {"dtype": "float32", "shape": [14], "name": "batch_normalization_21/beta"}, {"dtype": "float32", "shape": [14], "name": "batch_normalization_21/moving_mean"}, {"dtype": "float32", "shape": [14], "name": "batch_normalization_21/moving_variance"}, {"dtype": "float32", "shape": [28], "name": "batch_normalization_22/gamma"}, {"dtype": "float32", "shape": [28], "name": "batch_normalization_22/beta"}, {"dtype": "float32", "shape": [28], "name": "batch_normalization_22/moving_mean"}, {"dtype": "float32", "shape": [28], "name": "batch_normalization_22/moving_variance"}, {"dtype": "float32", "shape": [56], "name": "batch_normalization_23/gamma"}, {"dtype": "float32", "shape": [56], "name": "batch_normalization_23/beta"}, {"dtype": "float32", "shape": [56], "name": "batch_normalization_23/moving_mean"}, {"dtype": "float32", "shape": [56], "name": "batch_normalization_23/moving_variance"}, {"dtype": "float32", "shape": [112], "name": "batch_normalization_24/gamma"}, {"dtype": "float32", "shape": [112], "name": "batch_normalization_24/beta"}, {"dtype": "float32", "shape": [112], "name": "batch_normalization_24/moving_mean"}, {"dtype": "float32", "shape": [112], "name": "batch_normalization_24/moving_variance"}, {"dtype": "float32", "shape": [224], "name": "batch_normalization_25/gamma"}, {"dtype": "float32", "shape": [224], "name": "batch_normalization_25/beta"}, {"dtype": "float32", "shape": [224], "name": "batch_normalization_25/moving_mean"}, {"dtype": "float32", "shape": [224], "name": "batch_normalization_25/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 3, 64], "name": "block1_conv1_4/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv1_4/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "block1_conv2_4/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2_4/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "block2_conv1_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv1_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "block2_conv2_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv2_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "block3_conv1_4/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv1_4/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv2_4/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv2_4/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv3_4/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv3_4/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "block4_conv1_4/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv1_4/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv2_4/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv2_4/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv3_4/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv3_4/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_21/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 256], "name": "conv2d_22/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_22/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 128], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_23/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 64], "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_24/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 8], "name": "conv2d_25/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_25/bias"}]}], "modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "mean_squared_error", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 9.999999747378752e-06}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 3, 224, 224], "name": "input_5", "sparse": false}, "name": "input_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"name": "block1_pool", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block1_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"name": "block2_pool", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"name": "block3_pool", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"name": "block4_pool", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_17", "data_format": "channels_first"}, "name": "zero_padding2d_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_21"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "up_sampling2d_17", "interpolation": "nearest"}, "name": "up_sampling2d_17"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["up_sampling2d_17", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_18", "data_format": "channels_first"}, "name": "zero_padding2d_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_22"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "up_sampling2d_18", "interpolation": "nearest"}, "name": "up_sampling2d_18"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["up_sampling2d_18", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_19", "data_format": "channels_first"}, "name": "zero_padding2d_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_23"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_23"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "up_sampling2d_19", "interpolation": "nearest"}, "name": "up_sampling2d_19"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["up_sampling2d_19", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_20", "data_format": "channels_first"}, "name": "zero_padding2d_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_24"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_24"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "up_sampling2d_20", "interpolation": "nearest"}, "name": "up_sampling2d_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_20", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_25"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_25"}, {"class_name": "Reshape", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"target_shape": [-1, 50176], "trainable": true, "name": "reshape_5"}, "name": "reshape_5"}, {"class_name": "Permute", "inbound_nodes": [[["reshape_5", 0, 0, {}]]], "config": {"dims": [2, 1], "trainable": true, "name": "permute_5"}, "name": "permute_5"}, {"class_name": "Activation", "inbound_nodes": [[["permute_5", 0, 0, {}]]], "config": {"activation": "softmax", "trainable": true, "name": "activation_5"}, "name": "activation_5"}], "input_layers": [["input_5", 0, 0]], "name": "model_15", "output_layers": [["activation_5", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}